
# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8  
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
backbone:
  # [from, number, module, args]
  [ #[-1, 1, Conv, [64, 3, 2]], # Input size:[1,3,256,256]
   [-1, 1, Conv, [128, 3, 2]],  # 0-P1/2 Size:128
   [-1, 1, SELayer, [32]],
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P2/4 Size:64
   [-1, 1, SELayer, [64]],
   [-1, 6, C3, [512]],
   [-1, 1, Conv, [512, 3, 2]],  # 6-P3/8 Size:32
   [-1, 1, SELayer, [128]],
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P4/16 Size:16
   [-1, 1, SELayer, [256]],
   [-1, 3, C3, [1024]],
   [-1, 1, Conv, [1024, 3, 2]],  # 12-P5/32 Size:8
   [-1, 1, SPPF, [1024, 5]],  # 13
  ]


# YOLOv5 v6.0 backbone


# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #Size 16
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 17 (P4)

   [-1, 1, Conv, [512, 3, 1]], # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # Size 32
   [[-1, 8], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 21 (P5/32-large)
   
   [-1, 1, Conv, [256, 3, 2]],  #22
   [[-1, 18], 1, Concat, [1]],  # cat head P4 #size 16
   [-1, 3, C3, [512, False]],  # 24 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  #25
   [[-1, 12], 1, Concat, [1]],  # cat head P5 #size 8
   [-1, 3, C3, [1024, False]],  # 27 (P5/32-large)

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
